docs/documentation.org
#+TITLE:       Syndesis CI documentation
#+AUTHOR:      Ioannis Canellos
#+DATE:        27/09/2017
#+EMAIL:       iocanel@gmail.com
#+LANGUAGE:    en


* introduction

  This document intends to be a one stop doc for all things related to Syndesis CI / CD.
  The documentation starts by describing, the goals and challenges and then move into implementation details.
  Before all that it makes sense to write some notes about the environment and the syndesis project...

** environment

   The target environment for both the project and the CI/CD infrastructure is Openshift. In particular for development purposes we have: https://api.rh-idev.openshift.com:8443.
   The Openshift projects / namespace(s) of interest are:

   + syndesis-ci
   + syndesis-staging

** source code

*** Project sources

    + https://github.com/syndesisio/syndesis-ui
    + https://github.com/syndesisio/syndesis-rest
    + https://github.com/atlasmap/atlasmap
    + https://github.com/syndesisio/connectors

*** CI/CD related sources

    +  https://github.com/syndesisio/syndesis-jenkins (our custom [[jenkins image]], with the plugins of our choice and our job defintions & more)
    +  https://github.com/syndesisio/syndesis-ci (the project that contains ci related Openshift manifests. Includes deployment configs, services, secrets & installation scripts)
    +  https://github.com/syndesisio/syndesis-pipeline-librarsuv 2017 1600 ccy (a jenkins pipeline library specific to syndesis)
    +  https://github.com/syndesisio/nsswrapper (a container that initializes the nsswrapper, and use useful in our build pods as init container, more later)

*** CI/CD related forks

    We often hit the limits of the tools we use and we need to trail blaze, that's why we have maintain forks for the following projects:

    + https://github.com/syndesisio/kubernetes-plugin
    + https://github.com/syndesisio/kubernetes-pipeline-plugin (we can possibly remove)
    + https://github.com/syndesisio/arquillian-cube (we can possibly now remove)
    + https://github.com/iocanel/workflow-cps-global-lib-plugin

* goals

  The overall goal is to have a CI/CD environment that will be able to support our git workflow and will allow us to roll out features to our production environments as fast as possible.

** the git workflow

   Currently all development is done on github, and we are using a pull request workflow. Each pull request needs to be validated, reviewed before it can get merged.
   So our CI/CD environment needs to be able to react on the following events:

   + Creation of a pull request.
   + Modification of a pull request.
   + Approval of a pull request.

** rolling out changes

   Each change that gets into the master branch of our individual projects needs to reach our staging environment as soon as possible.
   So for everything that gets into master, we need to run our system tests and if they pass, we need to roll out:

   + Update deployments
   + Update images
     + Update image streams tags
     + Update docker.io latest tags

   Ideally, all of the above should be done, with the minimal possible configuration in the jenkins side. Using organization scanning, convention over configuration to keep things simple is really desirable.

* challenges

** security
   When working with Openshift the biggest challenges stem from the security related restrictions.
   The two most common sources of issues are the following:

*** arbitrary user ids <<arbitrary user ids>>
    Containers are not run as root. Instead the run as an arbitrary user named `default` with a generated uid.
    The user is not included in the /etc/passwd file, doesn't have a valid $HOME environment variable and that often leads to issues.

    For example:
    + The git binary requires the presence of the uid in /etc/passwd.
    + Maven doesn't know how to read user settings.xml from ~/.m2/settings.xml

    While there are workarounds for the problem like the above, sometimes they require modification of images or manifests.
    The suggested approach from Openshift is described here: https://docs.openshift.com/enterprise/3.2/creating_images/guidelines.html#openshift-enterprise-specific-guidelines.

*** permissions

    Due to the multi-tenant nature of Openshift, users are more restricted than vanilla Kubernetes.
    Those restrictions create new challenges:

***** what is the role that allows the user to do X on Y?

      Often we need to allow a user / service account to perform an operation. We can use something like:

      #+BEGIN_SRC sh :results output replace
      oc adm policy who-can create rolebindings
      #+END_SRC

      #+RESULTS:
      #+begin_example
      Namespace: syndesis-ci
      Verb:      create
      Resource:  rolebindings

      Users:  admin
              iocanel
              mmelko
              syndesisqe
              system:admin
              system:serviceaccount:syndesis-ci:jenkins

      Groups: dedicated-admins
              system:cluster-admins
              system:masters

#+end_example

      Even though its easy to find which user or service account do have the right to perform an action, there is no obivious we to find which is the role, that we need to bind to the user in order to gain permission.
      (If there is one, please update this section...)

***** how things work with generated projects?

      A service account may have permissions to create a new and use a new project (by using the self-provisioner role), but modifying an other projects service accounts & permissions can be tricky.
      For example: Having a service account create a new project and modify its rolebindings, can be tricky (need someone to verify that).

***** tackle differences between users and service accounts

      The example above is something that works fine when you do it as a user from the cli (due to the fact that for rh-idev we are all dedicated-admins), but doesn't work from a service account.
      This is a constnat source of confusion and it can easily lead to dead-ends.


** pipelines

   Pipelines read like groovy and that is both good and bad at the same time. It's good because its easy to understand, its bad because it doesn't execute like groovy and that is a often a source of unpleasant surprises.

*** mixed execution environments

    Each statement (will call them step from now on) inside a groovy pipeline can be possilby executed in three different envionements, dependings on the implemenation and context:

**** in master

     Out of the box every single step is executed inside Jenkins master !!!
     Even if the build has allocated an agent, the pipeline step execution ALWAYS happens inside the master.

**** in the agent

     A step may or may not, share some of the load, by sending java.lang.Runnable objects for execution to the slave.
     This is something that needs to be done explicitly and is also a feautre, that's not been used really often (relatively unknown feature).

