docs/documentation.org
**** remote host

     Pipeline steps that need to create a process, may choose to do it either locally or remotely, by creating and defining a custom process launcher or a launcher decorator.
     Some examples:

      #+BEGIN_SRC groovy
     node {
       sh 'echo "I run on the node (either master or agent)"'
     }
     #+END_SRC

      #+BEGIN_SRC groovy
     docker.image('alpine').inside {
       sh 'echo "I run inside a docker container"'
     }
     #+END_SRC

      #+BEGIN_SRC groovy
     kubernetes.image('alpine').inside {
       sh 'echo "I run inside a pood"'
     }
     #+END_SRC

      The examples above demonstrate how the same step means 3 different depending on the context.
      So this can easily lead to a lot of furtration. For example: if one process requires access to an environment variable, or a volume, you need to have a very good undersanding of where this process will end up being created.

** testing

   To validate both our pull requests, merges and roll outs we need to run automated tests, that will test everything as a whole. So the basic requirements are:

**** fully automate the deployment process
     So we need to have a set of templates that can be easily installed as part of the test preparation.
     We also need to have a set of parameter values to pass to the templates:
     + github oauth apps

**** polyglot support
     This needs to be something that can support tests written in any language.

**** ci/cd self validation
     Doing CI/CD for a microservices architecture is one thing, doing CI/CD for your CI/CD infrastructure is an other.
     + How do you validate changes to your pipeline libraries?
     + How do you vaidate changes to your test suite itself (if its externally hosted)?

* implementation
  This section describes the current implementation.
  It start's by the documenting the Openshift templates, and then takes items defined in the templates piece by piece...
** syndesis ci project
   The syndesis ci project lives at https://github.com/syndesisio/syndesis-ci and it contains Openshif templates, configuration files and scripts to install everything from scratch.

   Due to the recurring issues with pvc timeouts, we have two flavours of the templates:
   + ephemeral
   + persistent

   Since jenkins feeds the system and end to end tests, with parameters like:
   + github oauth client id
   + github oauth secert
   + github access token

   The parameters are also present in the syndesis ci templates.

   Along the templates, there are a couple of secrets that need to be created and require additional parameters
   + gpg keys (for signing artifacts)
   + ssh keys (for accessing github via cli)
   + m2 settings.xml (requires sonatype credentials + gpg key name)

   A one liner for creating the secrets and applying the configuration is provided by: https://github.com/syndesisio/syndesis-ci/blob/master/install.sh
   The scripts reads sensitive information from password store: https://www.passwordstore.org/, but if that is not available it can be easilty tuned to use environment variables.

** <<jenkins image>>jenkins image

   Our custom jenkins image lives at: https://github.com/syndesisio/syndesis-jenkins and its based on: https://github.com/openshift/jenkins.

   From the parent image we get for free the following:
   + openshift oauth via https://github.com/openshift/jenkins-openshift-login-plugin
   + a sane default configuration for the kubernetes plugin.
   + an image with solved the [[arbitrary user ids]].

*** why a custom image?
    It's highly unlikely that an existing image, will contain, the exact same plugins as we need.
    On top of that we are using internal forks for some of the plugin.
    Last but not least, we need the job definitions to be either provided as secret or baked in to the image and the same applies to initialization groovy scripts.

*** what plugins do we use?
    + The kubernetes-plugin, for providing jenkins agent via kubernetes pod. Lives at: https://github.com/jenkinsci/kubernetes-plugin
    + The kubernetes-pipeline-plugin, for its arquillian steps (update with internal link). Lives at: https://github.com/jenkinsci/kubernetes-pipeline-plugin
    + The github-branch-source-plugin. for providing multibracnh project support. Lives at: https://github.com/jenkinsci/github-branch-source-plugin
    + The gloabl pipeline library plugin, for pipeline library support etc. Lives at: https://github.com/jenkinsci/workflow-cps-global-lib-plugin

    Plugins like, pipeline, credentials, blue ocean etc are not mentioned in detail, but ARE part of our image. Same applies to transitives.

*** custom initialization
    For sensitive information kubernetes/openshift use secrets and jenkins is using [[https://wiki.jenkins.io/display/JENKINS/Credentials+Plugin][credentials]]. So we need a way of passing secrets into the jenkins container and have jenkins read them into credentials.
    For such kind of customizations / initializations a handy approach is to use groovy scripting. And this is what we do:

    + we pass secrets as environment variables to the jenkins container.
    + we use groovy to convert these environment variables into credentials. The script live at: https://github.com/syndesisio/syndesis-jenkins/blob/master/configuration/init.groovy.d/setup-github-credentials.groovy

    It worths mentioning that passing secrets as environment variables is not ideal and we should [[todo-3][read jenkins credentials from mounted secrets instead of environment variables]].

*** job definition
    To define jobs, we have picked https://github.com/jenkinsci/github-branch-source-plugin, because:
      + It makes it easy to add and configure projects
      + supports pull requests

    We would like on top of that to have:
     + [[todo-1][full org scanning]]
     + [[todo-2][merge triggers]]

    Since at the moment we don't have full org scanning, the jobs are defined as part of our [[jenkins image]]. For example: https://github.com/syndesisio/syndesis-jenkins/blob/master/configuration/jobs/syndesis-rest/config.xml

    Other candidates where:
      + https://github.com/jenkinsci/github-organization-folder-plugin. Now deprecated by was an excellent example of full org scanning.
      + https://github.com/jenkinsci/ghprb-plugin. Provides merge triggers but doesn't support pipelines: https://github.com/jenkinsci/ghprb-plugin/issues/528. Also seems low on activity.


    These job are pipeline jobs and will use out of the box the 'Jenkinsfile' that lives in the root of the source repository.

** <<pipeline library>> pipeline library

   For pipelines to be readable, clean and dry its a good idea to use a pipeline library.
   The pipeline library can hide implementation low level details from the Jenkinsfile and make the Jenkinsfile more comprehensive to everyone.
   For example:

   #+BEGIN_SRC groovy
   slave {
      withMaven {
         container( 'maven' ) {
           sh 'mvn clean install'
         }
      }
   }
   #+END_SRC groovy

   The pipeline above is pretty clear on what it does, but hides the how, which is encapsulated by the pipeline library itself. That is the added value of a pipeline library.

   The pipeline library for the syndesis project lives at: https://github.com/syndesisio/syndesis-pipeline-library.
   The library itself is a small subset of the fabric8 pipeline library, tuned to serve best the syndesis needs and requirements.

