docs/documentation.org
*** why not just use the fabric8 pipeline library?

    The fabric8 pipeline library has a wider scope both in functionality and in target platforms. Syndesis CI instead only needs to work great on  https://api.rh-idev.openshift.com:8443.
    This means specific features, approaches, workarounds we may employ in the syndesis project, may be irrelevent for fabric8 and vice versa.
    Trying to tackle different scopes under a single source repository would only slow things down and cause furstration, headaches to both teams.
    So instead, we keep our own repository, that is being tested by our internal CI infrastructure targeting our environment etc and we contribute features to the fabric8 pipeline library where it makes sense.

    Long term, when we will be CI complete and the library will not be as volatile as is right now, we need to [[todo-4][align and merge syndesis pipeline library to fabric8]].

*** creating build containers

    One of the most important things this pipeline library provides, is functions that allow you to compose build containers.

**** what are build containers?

    Each build has its own requirements. Different builds use different tools or different versions of tools. In the old days, all those tools need to get configured to jenkins itslef and then referenced in the pipelines.
    Nowadays, an approach popularized by the https://github.com/jenkinsci/docker-workflow-plugin is to add tools into containers, and reference containers from pipelines. This removes the extra step and coupling of configuring tools to Jenkins.

    Of course, in openshift access to docker shouldn't be taken for granted. Also going directly to docker means we can't use kubernetes/openshift specific resources like configuration maps or secrets.
    So for Kubernetes and Openshift such containers are provided by the [[https://github.com/jenkinsci/kubernetes-plugin][kubernetes plugin]].

**** how does the kubernetes plugin work?

     The [[https://github.com/jenkinsci/kubernetes-plugin][kubernetes plugin]] is mostly responsible for creating agent pods. But these pods may contain additional containers (as sidecars) that can be used as build containers.
     Then the user is able to select which is the container of the pod that will execute a certain instruction (ONLY sh based pipeline steps are supported).

     The structure of the agent pod, can be described by the pod template (as the name implies a template for creating agent pods). The plugin provides pipeline steps for both defining and using these templates.
     For example:

     #+BEGIN_SRC groovy
     def template = podTemplate(cloud: "openshift", name: "mytemplate", namespace: "syndesis-ci", label: "mylabel",
            containers: [containerTemplate(name: 'maven', image: "maven", command: '/bin/sh -c', args: 'cat', ttyEnabled: true)])
     #+END_SRC

     The template above defines a pod template that contains two containers: i) the agent container (jnlp) and ii) the maven container. The first is required, and if ommitted its added by the plugin.
     Pod templates are hierarchical (e.g. they can extend a parent template). This feautre can be expressed in pipeline using nesting:

     #+BEGIN_SRC groovy
     def composite = podTemplate(cloud: "openshift", name: "mvn", namespace: "syndesis-ci", label: "mvn",  containers: [containerTemplate(name: 'maven', image: "maven", command: '/bin/sh -c', args: 'cat', ttyEnabled: true)])  {
         podTemplate(cloud: "openshift", name: "go", namespace: "syndesis-ci", label: "go",  containers: [containerTemplate(name: 'go', image: "go", command: '/bin/sh -c', args: 'cat', ttyEnabled: true)])
     }
     #+END_SRC

     The snippet above uses nesting to compose a pod template out of two different ones: i) mvn and ii) go.

     As you may have noticed build containers start and do nothing (they execute cat, which causes them to wait forever). This is desired. When we need to usem inside a pipeline, the kubernetes plugin will allow us to exec into them and run the shell command of our choice.

     But how do we select in which container we want to execute each shell command? Out of the box all `sh` instructions are executed by the agent container. If the user needs to change that, then the `sh` step needs to be wrapped in a `container` step, for example:


     #+BEGIN_SRC groovy
     container( 'maven' ) {
        sh 'mvn clean install'
     }
     #+END_SRC

     More details on what are the exact features of the plugin can be found in the [[https://github.com/jenkinsci/kubernetes-plugin/blob/master/README.md][kubernetes plugin readme.]]

     Below are some of the most important pieces of the pipeline library:

***** [[https://github.com/syndesisio/syndesis-pipeline-library/blob/master/vars/slave.groovy][slave]]

      A pod template that defines a template with just the agent pod. From there the pod can be further customized using the nesting concept. The agent container can be customized by defining properties like:

****** jnlpImage
       The image for the agent container. Defaults to `openshift/jenkins-slave-maven-centos7`

****** serviceAccount
       The service account to use. Defaults to 0.

****** namespace
       The namespace to use. Defaults to `syndesis-ci`.

***** [[https://github.com/syndesisio/syndesis-pipeline-library/blob/master/vars/inside.groovy][inside]]

      A function that is responsible for creating a node out of a pod template. Usually after a pod template is defined, we need to create a node, that has as an argument a label that matches one of the available templates.
      The inside function handles that for the user:

      #+BEGIN_SRC groovy
      slave {
        podTemplateDecorator {
            inside {
               sh 'echo "do stuff"'
            }
        }
      }
      #+END_SRC

***** [[https://github.com/syndesisio/syndesis-pipeline-library/blob/master/vars/withMaven.groovy][withMaven]]

       A pod template decorator function that adds a maven container to the pod.

****** mavenImage
       The image for the maven container. Defaults to `library/maven:3.5.0`

****** envVars
       A list of container environment variables. Default to `[MAVEN_OPTS=-Duser.home=${workingDir} -Dmaven.repo.local=${workingDir}/.m2/repository/]`.
       The main reason we pass by default these environment variables to the container, is to let the maven know which is the home directory so that the user settings.xml can be found.
       In the same spirit we also configure the maven local repository.

****** workingDir
       The working directory. Default to `/home/jenkins`.

****** mavenRepositoryClaim
       The maven repository claim to use for the maven local repository. Defaults to ``.

****** mavenSettingsXmlSecret
       The kubernetes secret that contains a valid maven settings.xml. Defaults to ``. This should possibly change to m2-settings, which is the secret created by  https://github.com/syndesisio/syndesis-ci/blob/master/install.sh.

****** mavenSettingsXmlMountPath
       The path where the settings.xml will be mounted. Default to `${workingDir}/.m2`.

****** serviceAccount
       The service account to use. Defaults to ``.

****** namespace
       The namespace to use. Defaults to `syndesis-ci`.


       In the same spirit there are decorator functions for: golang, yarn, openshift etc.

