docs/documentation.md
    
        A pod template decorator, that adds an init container that sets up the nsswrapper. This is usefull for handling the issues caused by [3.1.1](#org85b6406), with composition instead of inheritance. The idea is that when nsswrapper is loaded, it can be configured to accept an external passwd and use that instead of /etc/passwd (transparently). The provided passwd may contain a user matching the current uid, allowing us to control the user name, home directory etc and eventually allowing us to change the user under which the containers of the pod will run.
        
        So the init container managed by this template, copies the library to folder accessible by all containers of the pod, and also generates the proper passwd template that will be used by nsswrapper. Last but not least, it decorates all containers with all the required environment variables:
        
        -   LD<sub>PRELOAD</sub> The path of libnsswrapper.so
        -   NSS<sub>WRAPPER</sub><sub>PASSWD</sub> The location of the provided passwd
        -   NSS<sub>WRAPPER</sub><sub>GROUP</sub> The location of the provided group file (e.g. /etc/group).
        
        1.  image
        
            The image to use. An image that provides access to the libnsswrapper.so file. Defaults to \`syndesis/nsswrapper\`.
        
        2.  username
        
            The username of that will be created for us.
        
        3.  group
        
            The group that the user will be added.
        
        4.  description
        
            The description of the user.
        
        5.  home
        
            The generated user home directory.
        
        6.  nssDir
        
            This is where the libnsswrapper.so file will be copied to. Default to \`/home/jenkins\`.
            
            Note: Since the basic idea is to copy a library, this can only work if containers that will use the library, are compatible. For example the default image (the [nsswrapper](https:/github.com/syndesisio/nsswrapper)) which is centos based will not work with alpine based containers (see glibc vs musl).
    
    5.  [withGpgKeys](https://github.com/syndesisio/syndesis-pipeline-library/blob/master/vars/withGpgKeys.groovy)
    
        A pod template decorator, that imports gpg keys, to ~/.gnupg. This requires the use of \`withArbitraryUser\`. The keys can be used for signing artifacts, which is required for releases etc.
        
        1.  image
        
            The image to use. An image that provides access to the gpg binary is required. Defaults to \`centos:centos7\`.
        
        2.  home
        
            The home dir to use. Default to \`/home/jenkins\`.
        
        3.  namespace
        
            The namespace to use. Defaults to \`syndesis-ci\`.
    
    6.  [withSshKeys](https://github.com/syndesisio/syndesis-pipeline-library/blob/master/vars/withSshKeys.groovy)
    
        A pod template decorator, that imports ssh keys, to ~/.ssh. This requires the use of \`withArbitraryUser\`. The keys can for git+ssh on github.
        
        1.  image
        
            The image to use. An image that provides access to the gpg binary is required. Defaults to \`centos:centos7\`.
        
        2.  home
        
            The home dir to use. Default to \`/home/jenkins\`.
        
        3.  namespace
        
            The namespace to use. Defaults to \`syndesis-ci\`.

3.  utility functions

    The pipeline library is not just about pod template decorators. It also houses utilities that are reusable accross pipelines:
    
    1.  [buildId](https://github.com/syndesisio/syndesis-pipeline-library/blob/master/vars/buildId.groovy)
    
        A function that returns a build id, that can be used to label our build containers. The generated id, is a string that contains information about the build, like the job name and number (as provided by jenkins). This id makes an ideal label for the build containers, as it will end up in the generated pod name, making it easy to correlate builds with pods.
    
    2.  [test](https://github.com/syndesisio/syndesis-pipeline-library/blob/master/vars/test.groovy)
    
        A function that checks out and builds: <https://github.com/syndesisio/syndesis-system-tests>. This test suite is practically empty. But it does use arquillian cube kubernetes, to ensure that what we build is at least deployable.
    
    3.  [rollout](https://github.com/syndesisio/syndesis-pipeline-library/blob/master/vars/rollout.groovy)
    
        This is practically a wrapper around \`openshiftDeploy\` provided by <https://jenkins.io/doc/pipeline/steps/openshift-pipeline>.
    
    4.  [sonatypeRelease](https://github.com/syndesisio/syndesis-pipeline-library/blob/master/vars/sonatypeRelease.groovy)
    
        A function that given a maven container can perform a release on sonatype. Returns the release version. This is derived from the git log, after scrapping for entires generated the maven release plugin.
        
        Needs to run inside a container block that, provides at least:
        
        -   Access to the maven binary
        -   ~/.gpg for signing artifacts
        -   ~/.ssh for pushing artifacts to github (this also means that cloning using the git url is required).
        
        The requirements above can easily satisfied with the use of:[withMaven](https://github.com/syndesisio/syndesis-pipeline-library/blob/master/vars/withMaven.groovy), [withSshKeys](https://github.com/syndesisio/syndesis-pipeline-library/blob/master/vars/withSshKeys.groovy) & [withGpgKeys](https://github.com/syndesisio/syndesis-pipeline-library/blob/master/vars/withGpgKeys.groovy).
        
        Internally this function is doing the following:
        
        -   mvn release:clean release:prepare release:perform
        -   mvn org.sonatype.plugins:nexus-staging-maven-plugin:1.6.7:rc-close
        -   mvn org.sonatype.plugins:nexus-staging-maven-plugin:1.6.7:rc-release
        
        The last two steps are using the nexus staging plugin, to automatically close and release the staging repositroy that was generated from the first step.
        
        WARNING: In order to find the id of the staging repository, we are listing all repositories and grab the first that matches our group id. This needs to be improved as it means that we can have issues with concurrent releases.
        
        1.  branch
        
            The release branch. Defaults to \`master\`.
        
        2.  nexusServerId
        
            The id of the nexus server. This needs to be a server found in the server list inside the mave settings.xml. Nexus credentials will be picked from there. Defaults to \`oss-sonatype-staging\`.
        
        3.  profile
        
            The maven profile to enable when performing the release. Defaults to \`fabric8\`.
    
    5.  [imagePush](https://github.com/syndesisio/syndesis-pipeline-library/blob/master/vars/imagePush.groovy)
    
        Pushes an existing image to a docker registry.
        
        In openshift the lack of direct access to the docker daemon is constant source of pain. So, when we need to push images from within Openshift to an external registry its not trivial. A document describing the process can be found at: <https://blog.openshift.com/pushing-application-images-to-an-external-registry/>.
        
        Based on this document we created this function. The idea is that we create a [BuildConfig](https://docs.openshift.com/enterprise/3.2/dev_guide/builds.html#defining-a-buildconfig) that uses [DockerStrategy](https://docs.openshift.com/enterprise/3.1/dev_guide/builds.html#docker-strategy-options) to refer to an existing docker image or image stream tag, and an empty dockerfile source. That we use as input. So, we are essentially create a \`Pass Through\` build configuration which we use to easilly push image to external registries.
        
        WARNING: This is insanely slow to minishift, to the degrees that is completely unusable.
        
        1.  name
        
            The name of the buildconfig to generate. Defaults to \`\` (required).
        
        2.  registry
