docs/documentation.org
****** registry
       The target registry to push the image to. Defaults to `docker.io`.

****** user
       The actual user. Defaults to `syndesis`.

****** repo
       The repository. Defaults to `` (required).

****** tag
       The tag. Default to `latest`.

****** pushSecret
       The push secret to use for accessing the external registry.

****** imageStreamTag.
       The image stream tag. Defaults ``.

****** dockerImage
       The dockerImage. This only makes sense if we want to push an actual docker image and no imageStreamTag has been provided. Defaults to ``.

** testing
     This section focuses on how we test things.

*** [[https://github.com/arquillian/arquillian-cube][arquillian cube]]
    In our testing strategy [[https://github.com/arquillian/arquillian-cube][arquillian cube]] is vital, mostly because it maintains the testing namespace for us, and also because it provides helpers tools for deploying configuration, waiting until everything is ready and providing feedback if something goes wrong.
    The full documentation on cube can be found at: https://github.com/arquillian/arquillian-cube/blob/master/docs/kubernetes.adoc

*** [[https://github.com/syndesisio/syndesis-system-tests][syndesis system tests]]
   This project was initially created for the purpose of verifying pull requests against our various projects. No real tests have been added since.
   So its purpose is to mostly check that things can be installed (templates and images work).
   It's maven based and it directly uses [[https://github.com/arquillian/arquillian-cube][arquillian cube]].
   The basic configuration looks like this:

   #+BEGIN_SRC xml
   <?xml version="1.0"?>
   <arquillian xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
      xmlns="http://jboss.org/schema/arquillian"
      xsi:schemaLocation="http://jboss.org/schema/arquillian
      http://jboss.org/schema/arquillian/arquillian_1_0.xsd">

      <extension qualifier="kubernetes">
        <property name="env.setup.script.url">setup.sh</property>
        <property name="env.teardown.script.url">teardown.sh</property>
        <property name="wait.for.service.list">syndesis-rest syndesis-ui syndesis-keycloak</property>
        <property name="wait.timeout">600000</property>
      </extension>

   </arquillian>
   #+END_SRC

**** arquillian.xml
     Here is a break down of all the options that are passed to the [[https://github.com/syndesisio/syndesis-system-tests/blob/master/src/test/resources/arquillian.xml][arquillian.xml]]:

***** env.setup.url
      The url or relative path to a script that sets up the test namespace.
      Due to: https://github.com/openshift/origin/issues/13197 we extended: [[https://github.com/arquillian/arquillian-cube][arquillian cube]] so that it can work using shell scripts (to leverage `oc new-app` and workaround the bug).
      This is why use the setup/teardown scripts, instead of passing directly a url to the [[https://github.com/syndesisio/syndesis-openshift-templates][syndesis openshift templates]].
***** env.teardown.url
      The url or relative path to a script that tears down the test namespace.
***** wait.for.service.list
      A list of service that we need to wait until a valid endpoint for them has been created (and thus the pod providing it is ready).
      This option can generally be ommitted when passing a url with manifest we are installing, but is required when using a script instead?
      Why? Because in the first case, the framework knows of all the bits it installed, while in the later, it doesn't (installation is controlled by the script).
***** wait.timeout
      The amount of time to wait until everything has become ready.

**** setup.sh & teardown.sh

   Intenrally these scripts use environment variables to configure things like:

*****  KUBERNETES_NAMESPACE
      The target namespace.

***** SYNDESIS_TEMPLATE_TYPE
     The template type to use (e.g. syndesis, syndesis-restricted, syndesis-ephemeral-restricted).

***** SYNDESIS_TEMPLATE_URL
     The full url to the templates to use.

***** OPENSHIFT_TEMPLATE_FROM_WORKSPACE
     Flag to enable reading the template from the ${WORKSPACE} environment variable.
     This options is used when we want to verify pull requests against the template project itself.

***** OPENSHIFT_TEMPLATES_FROM_GITHUB_COMMIT
     The sha of the actual commit to use. Meant to be used for pull request validation (currently unused?).

*** [[https://github.com/syndesisio/syndesis-e2e-tests][syndesis end to end tests]]
    A test suite containing end to end tests. Internally it uses protractor.

    This suite needs to replace the [[https://github.com/syndesisio/sysndesis-system-tests][syndesis system tests]] in our pipelines, but there are some challenges we need: [[todo-6][provide a mechanism for handling a pool github oauth apps for our pipeline]].

**** <<testing non-java project with arquillian-cube and jenkins>>testing non-java project with arquillian-cube and jenkins

     Apparently, we can't directly use arquillian-cube for orchestrating tests written javascript/typescript etc.
     For this purpose we are using a jenkins plugin, that provides limited access to [[https://github.com/arquillian/arquillian-cube][arquillian cube]] features: https://github.com/jenkinsci/kubernetes-pipeline-plugin/tree/master/arquillian-steps

     Some examples:

     #+BEGIN_SRC groovy
     inNamespace(prefix: 'test') {
         //do stuff inside a namespace
     }
     #+END_SRC

     The snippet above will create a temporary namespace (as long as the the block is being executed). The generated namespace will have the specified prefix `test`.
     Alternatively, you can specify instead of a prefix a name and it will use a fixed name instead. If a project with a matching name already exists it will be reused, else it will be created.

     Once the project / namespace has been created, the test environment can be created using something like:

     #+BEGIN_SRC groovy
     createEnvironment(
        cloud: 'openshift',
        scriptEnvironmentVariables: ['OPENSHIFT_TEMPLATE_FROM_WORKSPACE': 'true', 'SYNDESIS_TEMPLATE_TYPE': 'syndesis-ci', 'WORKSPACE': "$WORKSPACE"],
        environmentSetupScriptUrl: "https://raw.githubusercontent.com/syndesisio/syndesis-system-tests/master/src/test/resources/setup.sh",
        environmentTeardownScriptUrl: "https://raw.githubusercontent.com/syndesisio/syndesis-system-tests/master/src/test/resources/teardown.sh",
        waitForServiceList: ['syndesis-rest', 'syndesis-ui', 'syndesis-keycloak', 'syndesis-verifier'],
        waitTimeout: 600000L,
        namespaceCleanupEnabled: false,
        namespaceDestroyEnabled: false
      )
     #+END_SRC

    The above will create an environment using shell scripts (as the our syndesis-system-tests arquillian.xml does), then it will wait until the specified services are 'ready to use'.

    WARNING: You always need to be mindful of what you can and cannot do inside a generated namespace. For example checking out a project and building it using `mvn package fabric8:build` will fail.
             Why? Because `system:serviceAccount:syndesis-ci:jenkins` will not have permission to build a project in other namespace even if the namespace has been created by the particular service account.
             Also, it won't be possible grant that privilege without human interaction. This significantly limits our options and a solution needs to be found.
             So we need to [[todo-7][find a way so that a service account can create a new project and modify its role bindings]].

* our setup
** ci related servers

