docs/documentation.org
*** jenkins

    As a CI/CD server we are using Jenkins 2. Since our target environment is Openshift, we scale Jenkins via https://github.com/jenkinsci/kubernetes-pipeline-plugin.
    For defining build jobs, we are using Jenkins pipeline (which is current the dominant approach for non-trivial build jobs).

    At the moment we are using two different Jenkins installations. Why? Mostly due to infrastructure related problems affecting the internal installation and miscommunication.

**** internal jenkins

     https://jenkins-syndesis-ci.b6ff.rh-idev.openshiftapps.com/
     The internal instance is used for pull request validation, and rolling out changes. You can access the instance via Openshift login, which eventually means via Github.

**** fabric8 jenkins

     https://ci.fabric8.io/
     Nowadays, its used for triggering merges, via the [merge] keyword, or via approving a pull request (something that involves https://github.com/syndesisio/pure-bot).

*** nexus

    Nexus is used as a mirror of the external repositories that we use. At the moment we use the following configuration inside our settings.xml:

    #+BEGIN_SRC xml
      <mirrors>
        <mirror>
          <id>nexus</id>
          <name>Nexus Central Mirror</name>
          <url>http://nexus:8081/content/groups/public/</url>
          <mirrorOf>*</mirrorOf>
        </mirror>
      </mirrors>
    #+END_SRC

    Of course, this is something that requires additional work in the nexus configuration.

    At the moment we are using the fabric8/nexus image hosted at: https://github.com/fabric8io/nexus-docker.
    Nexus is yet another case that is affected by [[arbitrary user ids]]. For this reason the nsswrapper is baked into the image.
    Also, this image has baked the configuration inside it. However we override it by mounting a custom [[https://github.com/syndesisio/syndesis-ci/blob/master/nexus.xml][nexus.xml]] at `/sonatype-work/conf`.

* future work

** <<todo-1>>full org scanning
Investigate if newer releases of https://github.com/jenkinsci/github-branch-source-plugin support full organization scanning.

** <<todo-2>>merge triggers
Investigate if there is an existing jenkins plugin that can enhance our job definitions, with merge trigggers (merge when a user enters a preconfigured 'phraze' or adds a 'label).
Investigate if it worths contributing that pieces of functionality ourselves.


** <<todo-3>>read jenkins credentials from mounted secrets instead of environment variables
This is pretty self explanatory. It's not the best of practices to pass sensitive information as environmnet variables and we should mount the secrets instead.

** <<todo-4>>align and merge syndesis pipeline library to fabric8
At the moment the two libraries are similar, but there are a few key differences, that may become a challenge to align.

*** single vs dual style decration
    For each kind of decorators, the fabric8 library is using the `template` and `node` variant. The first is the actual decorator and the last is the function the creates a node out of the decrator.
    In syndesis instead due to the use of composition (it wasn't provided as a feature by kubernetes-plugin when the fabric8 library was first written), we don't have need for the `node` variant at all (we just compoise with the [[https://github.com/syndesisio/syndesis-pipeline-library/blob/master/vars/inside.groovy][inside]]).

    So, we need to update the fabric8 pipeline library to the new style, in a fashion that will not break existing consumers of the library.

*** handle general vs platform specific features
    The syndesis library is ATM specific to openshift. We need to generalize it, so that it doesn't break the world when used in vanilla kubernetes (to the degree that possible as not all features wille ever be compatible with vanilla).
    The opposite needs to be done in the other side, Make sure that kubernetes specific bits, do not break our existing functionality, for example:
    + assuming root user.
    + assuming access to docker registry.

*** make things more configurable/modular
    It would be fantastic, if I could use the fabric8 pipeline library with my set of images (e.g. expose the image, service accounts etc as configuration parameters).
    Also it would be amazing, if I could selectively enable or disable features based on what I have available in my infra (e.g. I don't know if I can use the library without hubot. Need to check)

** <<todo-5>>find a better way of finding the staging repo id when doing releases
   At the moment we list all repositories on nexus, and we grep based on our group id. We end up using the first match (if found).
   This can cause issues if we have multiple releases going on (given that we have a single groupId for all our projects).

   We need to do better than that.

** <<todo-6>>provide a mechanism for handling a poll of github oauth apps for our pipelines
   Each test environment we create, needs to be isolated and only be accessed by the test suite that created it.
   This means that it needs a unique url. Since each url is referenced by the github oauth apps under https://github.com/settings/developers we need to have a unique app for each test suite.

   So we need a mechanism that can help us manage the "pool" of github oauth apps and urls.

** <<todo-7>>find a way so that a service account can create a new project and modify its role bindings.
   Currently, a service account with the `self-provisioner` role is able to create projects. But its not possible to modify role bindings inside the target project.
   Or at least its not possible to further extend its own privileges within the generated project.

   Example: the jenkins service account may create a temporary project X, but it cannot create builds inside X, nor grant itself the builder privilige within X.

   We need to find a way to handle it.
